{
  "metadata": {
    "lastUpdate": "2024-12-20",
    "version": "1.0",
    "author": "Mohamed Mokhtar El Mazani",
    "validated": false,
    "totalHoursRequired": 60,
    "minThemes": 6,
    "minActivities": 6
  },
  "activities": [
    {
      "id": "act_001",
      "theme": "Électronique et innovation",
      "title": "Hackathon Électro 2024 – Retour vers le futur",
      "type": "Hackathon",
      "hours": 10,
      "date": "2024-10-25",
      "status": "completed",
      "proof": {
        "type": "invitation + échanges officiels",
        "description": "Mails d'invitation, de confirmation et de mention de participation (certificat en attente)",
        "file": "photo_hackathon_2024.jpg"
      },
      "description": "Participation au Hackathon Électro 2024 organisé par l’EPHEC sur le thème « Récupérer de l’ancien pour imaginer et créer des produits modernes ». Événement de 48h combinant créativité, électronique et développement pour concevoir un prototype innovant à partir de matériel récupéré.",
      "reflection": {
        "context": "J’ai participé au Hackathon Électro 2024 organisé par les professeurs de la section TI de l’EPHEC. Cet événement rassemblait des étudiants de plusieurs années pour relever des défis de conception et de prototypage autour du thème du recyclage électronique et de l’innovation low-tech.",
        "facts": "Avec mon équipe, nous avons imaginé et développé un prototype fonctionnel à partir de matériel ancien. Le hackathon s’est déroulé sur un week-end complet, avec une réunion préparatoire sur Teams, des phases de brainstorming, de conception et de présentation finale des projets.",
        "projectLink": "Cette expérience m’a permis d’explorer la création d’objets connectés à faible coût et à faible impact environnemental, en lien direct avec mon intérêt pour l’IoT et le prototypage électronique. Elle a renforcé ma créativité et ma capacité à travailler en équipe dans des délais très courts.",
        "skills": "J’ai développé des compétences en prototypage électronique, travail collaboratif, gestion du temps, et présentation de projet. J’ai aussi découvert de nouvelles approches d’innovation circulaire et de réutilisation de composants.",
        "conclusion": "Ce hackathon m’a sensibilisé à la dimension durable de l’innovation technologique. Je compte réinvestir cette approche dans mes futurs projets IoT en intégrant davantage la récupération de composants et le design low-tech."
      },
      "skills": [
        "Prototypage électronique",
        "Travail d'équipe",
        "Innovation durable",
        "Créativité",
        "Gestion du temps",
        "Communication technique"
      ]
    },

    {
      "id": "act_002",
      "theme": "Hardware",
      "title": "Réparation de smartphones pour particuliers",
      "type": "Autre",
      "hours": 8,
      "date": "2024-02-10",
      "status": "completed",
      "proof": {
        "type": "photos",
        "description": "Photos des réparations et factures clients",
        "file": "repairs_smartphones_2024.zip"
      },
      "description": "Réparation de 5 smartphones différents : remplacement d'écrans, batteries et ports de charge.",
      "reflection": {
        "context": "Entre janvier et février 2024, j'ai effectué la réparation de 5 smartphones pour des particuliers de mon entourage. Cette activité découle de ma passion pour le hardware et de mon expérience personnelle en réparation électronique.",
        "facts": "Les interventions réalisées incluaient : 2 remplacements d'écran (iPhone 11 et Samsung A52), 2 changements de batterie (iPhone 8 et Xiaomi Redmi Note 9), et 1 réparation de port de charge (OnePlus 7). Chaque réparation a nécessité entre 1h30 et 2h de travail minutieux, incluant le diagnostic, la commande des pièces et l'intervention.",
        "projectLink": "Cette activité renforce directement mes compétences en diagnostic et résolution de problèmes hardware, essentielles pour un futur technicien IT. La capacité à réparer et maintenir du matériel informatique est un atout majeur dans le support technique, domaine que je vise pour mon stage.",
        "skills": "J'ai perfectionné ma dextérité manuelle et ma précision dans la manipulation de composants fragiles. J'ai appris à gérer la relation client, depuis le diagnostic initial jusqu'à la livraison, en passant par la communication sur les délais et les coûts. La gestion des stocks de pièces détachées m'a initié aux problématiques logistiques.",
        "conclusion": "Cette expérience m'a confirmé mon intérêt pour le hardware et m'a donné confiance dans ma capacité à gérer des interventions techniques de manière autonome. Je prévois d'étendre mes compétences aux réparations de laptops et tablettes."
      },
      "skills": ["Hardware", "Diagnostic", "Micro-soudure", "Relation client", "Précision technique", "Gestion des stocks"]
    },
    {
      "id": "act_003",
      "theme": "Hardware",
      "title": "Montage PC Gaming haute performance",
      "type": "Autre",
      "hours": 5,
      "date": "2024-01-20",
      "status": "completed",
      "proof": {
        "type": "photos",
        "description": "Photos du montage et résultats benchmarks",
        "file": "pc_gaming_build_2024.pdf"
      },
      "description": "Assemblage complet d'un PC gaming sur mesure pour un client, de la sélection des composants à l'optimisation.",
      "reflection": {
        "context": "En janvier 2024, un ami m'a sollicité pour l'assemblage d'un PC gaming avec un budget de 2000€. Ce projet m'a permis de mettre en pratique mes connaissances en hardware acquises durant ma formation et mon expérience personnelle.",
        "facts": "Le projet s'est déroulé en plusieurs phases : analyse des besoins (jeux visés, résolution souhaitée), sélection des composants (RTX 4070, Ryzen 7 5800X3D, 32GB DDR4), assemblage physique avec cable management optimisé, installation de Windows 11 et des drivers, overclocking CPU/GPU et tests de stabilité. Les benchmarks finaux montraient d'excellentes performances : 144 FPS constants en 1440p sur les AAA récents.",
        "projectLink": "Cette expérience concrète en assemblage et optimisation hardware est directement applicable à mon futur métier en support IT. La capacité à conseiller, assembler et optimiser des configurations est un atout majeur pour un technicien informatique.",
        "skills": "J'ai approfondi mes connaissances sur l'architecture des PC modernes, l'optimisation des performances via BIOS, et la gestion thermique. Le conseil client m'a permis de développer ma capacité à traduire des besoins en solutions techniques. La documentation du processus m'a initié aux bonnes pratiques professionnelles.",
        "conclusion": "Ce projet m'a donné une vision complète du cycle de vie d'un PC, de la conception à la livraison. Je souhaite maintenant me former sur les configurations serveur et workstation pour élargir mon champ de compétences."
      },
      "skills": ["Assemblage PC", "Overclocking", "Optimisation Windows", "Conseil technique", "Gestion thermique", "Benchmarking"]
    },
    {
      "id": "act_004",
      "theme": "Électronique/IoT",
      "title": "Laboratoire électronique - Soudure et prototypage",
      "type": "Autre",
      "hours": 2,
      "date": "2024-04-05",
      "status": "completed",
      "proof": {
        "type": "photos",
        "description": "Photos des circuits réalisés",
        "file": "labo_electronique_2024.jpg"
      },
      "description": "Session pratique de soudure de cables dans le laboratoire électronique de l'EPHEC.",
      "reflection": {
        "context": "Dans le cadre du cours d'électronique digitale, j'ai participé à une session de laboratoire de 2 heures focalisée sur la soudure de précision et le prototypage de circuits.",
        "facts": "Durant cette session, j'ai réalisé la soudure de composants CMS sur PCB, créé des connexions propres entre différents modules, et testé les circuits avec multimètre et oscilloscope. Le projet final était un circuit de régulation de tension avec indicateur LED.",
        "projectLink": "Ces compétences en électronique fondamentale complètent ma formation IT en me donnant une compréhension hardware au niveau le plus bas. Cette connaissance est précieuse pour diagnostiquer des problèmes matériels complexes.",
        "skills": "J'ai développé ma précision manuelle dans la soudure de composants miniatures, appris à lire et interpréter des schémas électriques, et maîtrisé l'utilisation d'instruments de mesure. La patience et la minutie requises m'ont appris l'importance de la méthode en électronique.",
        "conclusion": "Bien que courte, cette expérience m'a ouvert les yeux sur la complexité de l'électronique moderne. Je prévois de poursuivre avec des projets Arduino/Raspberry Pi pour combiner électronique et programmation."
      },
      "skills": ["Soudure CMS", "Lecture de schémas", "Multimètre", "Oscilloscope", "Prototypage", "Précision manuelle"]
    },
    {
      "id": "act_005",
      "theme": "Communication",
      "title": "Tech Career Night - AXA Belgium",
      "type": "Visite entreprise",
      "hours": 5,
      "date": "2025-10-13",
      "status": "completed",
      "proof": {
        "type": "badge",
        "description": "Badge d'accès à l'événement + Photos + Connexions LinkedIn",
        "file": "axa_tech_night_2025.pdf"
      },
      "description": "Participation à la Tech Career Night organisée par AXA Belgium au siège de Bruxelles. Découverte de l'innovation IT, IA, Cloud et transformation digitale dans le secteur de l'assurance.",
      "reflection": {
        "context": "Le 13 octobre 2025, j'ai participé à la Tech Career Night organisée par AXA Belgium dans leurs locaux de la Place du Trône à Bruxelles. Cet événement visait à présenter les métiers IT du groupe, leurs innovations technologiques et à créer des opportunités de networking entre étudiants et professionnels du secteur.",
        "facts": "La soirée s'est articulée autour de trois activités principales. D'abord, le Silent Disco avec deux présentations immersives : l'une sur l'intégration de l'IA chez AXA (SecureGPT, GitHub Copilot, COO Assistant) et l'autre sur la transformation digitale avec le programme CLUP. J'ai découvert leur stack technique moderne : TypeScript, Angular, Java Spring Boot, PostgreSQL, MongoDB et AWS. Ensuite, le Speed Networking m'a permis d'échanger avec quatre professionnels IT : un testeur, un Head of Network, un DevOps Cloud et un Feature Manager. La soirée s'est conclue par un Street Food Dinner propice aux échanges informels avec les RH et autres participants.",
        "projectLink": "Cet événement s'inscrit parfaitement dans ma recherche de stage en infrastructure IT. La découverte concrète de l'utilisation de l'IA et du Cloud dans une grande entreprise m'a donné une vision claire des compétences recherchées sur le marché. Les contacts établis, notamment avec les RH du département IT, pourront déboucher sur des opportunités de stage. Cette expérience confirme mon intérêt pour les environnements techniques complexes où innovation et sécurité sont primordiales.",
        "skills": "J'ai développé mes compétences en networking professionnel, apprenant à présenter mon parcours de manière concise lors du speed networking. J'ai approfondi ma compréhension de l'IA appliquée en entreprise, notamment les modèles GPT et leur intégration sécurisée. Ma culture technique s'est enrichie sur les architectures Cloud AWS et les pratiques DevOps. J'ai également amélioré ma capacité à échanger en anglais technique, certaines présentations étant dans cette langue.",
        "conclusion": "Cette Tech Career Night a dépassé mes attentes en termes d'apprentissage et de networking. Elle m'a permis de comprendre concrètement comment une grande entreprise comme AXA utilise les technologies de pointe tout en maintenant sécurité et conformité. Les connexions LinkedIn établies et les échanges avec les RH ouvrent des perspectives concrètes pour mon stage. Je compte maintenir ces contacts et postuler aux opportunités de stage chez AXA, fort de cette première immersion dans leur culture d'entreprise."
      },
      "skills": [
        "Networking professionnel",
        "Intelligence Artificielle",
        "Cloud AWS",
        "Communication",
        "Anglais technique",
        "Culture d'entreprise",
        "Transformation digitale"
    ]
    }
    
  ],
  "statistics": {
    "currentTotalHours": 30,
    "remainingHours": 30,
    "currentThemes": ["Sécurité", "Hardware", "Électronique/IoT", "Communication"],
    "themesCount": 4,
    "activitiesCount": 5,
    "completionPercentage": 50
  },
  "validation": {
    "hoursCheck": "❌ Manque 30 heures",
    "themesCheck": "❌ Manque 2 thèmes (minimum 6)",
    "activitiesCheck": "❌ Manque 1 activité (minimum 6)",
    "themeDistribution": {
      "Sécurité": 10,
      "Hardware": 13,
      "Électronique/IoT": 2,
      "Communication": 5
    }
  },
  "suggestions": {
    "missingThemes": ["Développement", "Réseaux", "Soft Skills", "Langues", "Droit IT"],
    "recommendedActivities": [
      "Formation en ligne Python/JavaScript (10h)",
      "Configuration réseau VLAN/Routing (8h)",
      "Présentation projet devant classe (5h)",
      "Certification Anglais technique (10h)",
      "Participation IT Job Day EPHEC (2h)",
      "Stage en entreprise (15h max)",
      "Projet personnel développement web (10h)"
    ]
  }
}